Revit 2024 API
BuiltInFailures.SketchFailures.CannotChangeUserSketchPlaneError Property
 Can't change plane of [Element Name] Sketch.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotChangeUserSketchPlaneError { get; }
Visual Basic
Public Shared ReadOnly Property CannotChangeUserSketchPlaneError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotChangeUserSketchPlaneError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace